[Killed] ObjectLiteral
main/components/MyReviews/ReviewForm.jsx:14:15
     register,
     formState: { errors },
     handleSubmit,
-  } = useForm({
-    defaultValues: {
-      reviewerComments: "",
-      itemsStars: 5,
-      dateItemServed: new Date().toISOString().slice(0, 16), // default to now, in YYYY-MM-DDTHH:mm format (UTC)
-    },
-  });
+  } = useForm({});
 
   const navigate = useNavigate();
killedBy: MyReviewsCreatePage - full coverage tests renders form fields with expected defaults
statusReason: expect(element).toHaveValue(5)

Expected the element to have value:
  5
Received:
  1

[Killed] MethodExpression
main/components/MyReviews/ReviewForm.jsx:18:23
     defaultValues: {
       reviewerComments: "",
       itemsStars: 5,
-      dateItemServed: new Date().toISOString().slice(0, 16), // default to now, in YYYY-MM-DDTHH:mm format (UTC)
+      dateItemServed: new Date().toISOString(), // default to now, in YYYY-MM-DDTHH:mm format (UTC)
     },
   });
killedBy: MyReviewsCreatePage - full coverage tests renders form fields with expected defaults
statusReason: expected '' not to be '' // Object.is equality

[Killed] BooleanLiteral
main/components/MyReviews/ReviewForm.jsx:57:32
               id="review-stars"
               {...register("itemsStars", {
                 // default+unemptiable, so required unneeded
-                valueAsNumber: true,
+                valueAsNumber: false,
                 min: 1,
                 max: 5,
killedBy: MyReviewsCreatePage - full coverage tests submits form and navigates on successful post
statusReason: expected { itemId: undefined, …(3) } to deeply equal { itemId: undefined, …(3) }
