[Killed] StringLiteral
main/components/MyReviews/ReviewForm.jsx:44:24
           id="review-comments"
           as="textarea"
           rows={3}
-          {...register("reviewerComments")} // not required
+          {...register("")} // not required
         />
       </Form.Group>
killedBy: MyReviewsCreatePage - full coverage tests renders form fields with expected defaults; ReviewForm tests renders correctly
statusReason: Cannot read properties of undefined (reading '_f')

[Killed] BooleanLiteral
main/components/MyReviews/ReviewForm.jsx:57:32
               id="review-stars"
               {...register("itemsStars", {
                 // default+unemptiable, so required unneeded for frontend
-                valueAsNumber: true,
+                valueAsNumber: false,
                 min: 1,
                 max: 5,
killedBy: MyReviewsCreatePage - full coverage tests submits form and navigates on successful post
statusReason: expected { itemId: undefined, …(3) } to deeply equal { itemId: undefined, …(3) }
