[Killed] ArrowFunction
main/components/Users/UsersTable.jsx:7:38
 import OurTable, { ButtonColumn } from "main/components/OurTable";
 import { useBackendMutation } from "main/utils/useBackend";
 
-const cellToAxiosParamsToggleAdmin = (cell) => ({
-  method: "PUT",
-  url: "/api/admin/toggleAdmin",
-  params: { id: cell.row.values.id },
-});
+const cellToAxiosParamsToggleAdmin = () => undefined;
 
 const cellToAxiosParamsToggleModerator = (cell) => ({
killedBy: UserTable tests Toggle Admin on another user fires PUT directly without modal
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <table

[Killed] ObjectLiteral
main/components/Users/UsersTable.jsx:10:11
 const cellToAxiosParamsToggleAdmin = (cell) => ({
   method: "PUT",
   url: "/api/admin/toggleAdmin",
-  params: { id: cell.row.values.id },
+  params: {},
 });
 
killedBy: UserTable tests Toggle Admin on another user fires PUT directly without modal
statusReason: expected {} to deeply equal { id: 1 }

[Timeout] ArrowFunction
main/components/Users/UsersTable.jsx:13:42
   params: { id: cell.row.values.id },
 });
 
-const cellToAxiosParamsToggleModerator = (cell) => ({
-  method: "PUT",
-  url: "/api/admin/toggleModerator",
-  params: { id: cell.row.values.id },
-});
+const cellToAxiosParamsToggleModerator = () => undefined;
 
 const baseColumns = [

[Killed] ObjectLiteral
main/components/Users/UsersTable.jsx:20:3
 });
 
 const baseColumns = [
-  {
-    Header: "id",
-    accessor: "id",
-  },
+  {},
   {
     Header: "First Name",
killedBy: AdminUsersPage tests renders without crashing on three users
statusReason: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/Users/UsersTable.jsx:41:3
     id: "admin",
     accessor: (row, _rowIndex) => String(row.admin), // hack needed for boolean values to show up
   },
-  {
-    Header: "Moderator",
-    id: "moderator",
-    accessor: (row, _rowIndex) => String(row.moderator),
-  },
+  {},
   {
     Header: "Alias",
killedBy: UserTable tests renders without crashing for empty table
statusReason: A column ID (or string accessor) is required!

[Timeout] StringLiteral
main/components/Users/UsersTable.jsx:42:13
     accessor: (row, _rowIndex) => String(row.admin), // hack needed for boolean values to show up
   },
   {
-    Header: "Moderator",
+    Header: "",
     id: "moderator",
     accessor: (row, _rowIndex) => String(row.moderator),

[Killed] BooleanLiteral
main/components/Users/UsersTable.jsx:74:46
 
 export default function UsersTable({ users, showToggleRoleButtons, currentUser }) {
   const navigate = useNavigate();
-  const [showModal, setShowModal] = useState(false);
+  const [showModal, setShowModal] = useState(true);
   const [pendingCell, setPendingCell] = useState(null);
 
killedBy: UserTable tests Toggle Admin on another user fires PUT directly without modal
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog"
  data-testid="confirm-admin-toggle-modal"
>
  <div
    class="modal-content"

[Killed] EqualityOperator
main/components/Users/UsersTable.jsx:92:9
   // Stryker restore all
 
   const toggleAdminCallback = (cell) => {
-    if (currentUser?.root?.user?.id === cell.row.values.id) {
+    if (currentUser?.root?.user?.id !== cell.row.values.id) {
       setPendingCell(cell);
       setShowModal(true);
killedBy: UserTable tests Toggle Admin on another user fires PUT directly without modal
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] OptionalChaining
main/components/Users/UsersTable.jsx:92:9
   // Stryker restore all
 
   const toggleAdminCallback = (cell) => {
-    if (currentUser?.root?.user?.id === cell.row.values.id) {
+    if (currentUser?.root.user?.id === cell.row.values.id) {
       setPendingCell(cell);
       setShowModal(true);
killedBy: UserTable tests Toggle Admin with currentUser missing root fires PUT without modal
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class=""
    style=""

[Killed] BooleanLiteral
main/components/Users/UsersTable.jsx:94:20
   const toggleAdminCallback = (cell) => {
     if (currentUser?.root?.user?.id === cell.row.values.id) {
       setPendingCell(cell);
-      setShowModal(true);
+      setShowModal(false);
     } else {
       toggleAdminMutation.mutate(cell);
killedBy: UserTable tests Toggle Admin on own row shows confirmation modal
statusReason: Unable to find an element by: [data-testid="confirm-admin-toggle-modal"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] BooleanLiteral
main/components/Users/UsersTable.jsx:112:18
   };
 
   const handleCancel = () => {
-    setShowModal(false);
+    setShowModal(true);
     // Stryker disable next-line all
     setPendingCell(null);
killedBy: UserTable tests Confirmation modal No button closes modal without toggling
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog"
  data-testid="confirm-admin-toggle-modal"
>
  <div
    class="modal-content"

[Killed] ConditionalExpression
main/components/Users/UsersTable.jsx:119:7
 
   const columns = [...baseColumns];
 
-  if (showToggleRoleButtons) {
+  if (false) {
     columns.push(
       ButtonColumn("Toggle Admin", "primary", toggleAdminCallback, "UsersTable"),
killedBy: UserTable tests Toggle role buttons appear when showToggleRoleButtons is true
statusReason: Unable to find an element by: [data-testid="UsersTable-cell-row-0-col-Toggle Admin-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/Users/UsersTable.jsx:121:20
 
   if (showToggleRoleButtons) {
     columns.push(
-      ButtonColumn("Toggle Admin", "primary", toggleAdminCallback, "UsersTable"),
+      ButtonColumn("", "primary", toggleAdminCallback, "UsersTable"),
     );
     columns.push(
killedBy: AdminUsersPage tests renders without crashing on three users
statusReason: A column ID (or string accessor) is required!
