[Killed] BlockStatement
main/components/Users/UsersTable.jsx:95:41
   );
   // Stryker restore all
 
-  const toggleAdminCallback = (cell) => {
-    if (currentUser?.root?.user?.id === cell.row.values.id) {
-      setPendingCell(cell);
-      setShowModal(true);
-    } else {
-      toggleAdminMutation.mutate(cell);
-    }
-  };
+  const toggleAdminCallback = (cell) => {};
 
   // Stryker disable next-line all
killedBy: UserTable tests Toggle Admin on another user fires PUT directly without modal
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <table

[Killed] ConditionalExpression
main/components/Users/UsersTable.jsx:96:9
   // Stryker restore all
 
   const toggleAdminCallback = (cell) => {
-    if (currentUser?.root?.user?.id === cell.row.values.id) {
+    if (false) {
       setPendingCell(cell);
       setShowModal(true);
killedBy: UserTable tests Toggle Admin on own row shows confirmation modal
statusReason: Unable to find an element by: [data-testid="confirm-admin-toggle-modal"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] BooleanLiteral
main/components/Users/UsersTable.jsx:110:18
   };
 
   const handleConfirm = () => {
-    setShowModal(false);
+    setShowModal(true);
     toggleAdminMutation.mutate(pendingCell);
     navigate("/");
killedBy: UserTable tests Confirmation modal Yes button fires PUT and navigates home
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog"
  data-testid="confirm-admin-toggle-modal"
>
  <div
    class="modal-content"

[Killed] StringLiteral
main/components/Users/UsersTable.jsx:126:9
   if (showToggleRoleButtons) {
     columns.push(
       ButtonColumn(
-        "Toggle Admin",
+        "",
         "primary",
         toggleAdminCallback,
killedBy: UserTable tests Toggle role buttons appear when showToggleRoleButtons is true
statusReason: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Users/UsersTable.jsx:129:9
         "Toggle Admin",
         "primary",
         toggleAdminCallback,
-        "UsersTable",
+        "",
       ),
     );
killedBy: UserTable tests Toggle role buttons appear when showToggleRoleButtons is true
statusReason: Unable to find an element by: [data-testid="UsersTable-cell-row-0-col-Toggle Admin-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
