[Killed] BlockStatement
src/main/pages/AdminUsersPage.jsx:7:30
 import { useBackend } from "main/utils/useBackend";
 import { useCurrentUser } from "main/utils/currentUser";
 
-const AdminUsersPage = () => {
-  const { data: currentUser } = useCurrentUser();
-
-  const {
-    data: users,
-    error: _error,
-    status: _status,
-  } = useBackend(
-    // Stryker disable next-line all : don't test internal caching of React Query
-    ["/api/admin/users"],
-    { method: "GET", url: "/api/admin/users" },
-    [],
-  );
-
-  return (
-    <BasicLayout>
-      <h2>Users</h2>
-      <UsersTable
-        users={users}
-        showToggleRoleButtons={true}
-        currentUser={currentUser}
-      />
-    </BasicLayout>
-  );
-};
+const AdminUsersPage = () => {};
 
 export default AdminUsersPage;
killedBy: AdminUsersPage tests renders without crashing on three users
statusReason: Unable to find an element with the text: Users. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style
